/**************************************************************
   SmartPlant

   1o Γυμνάσιο Ρόδου
   Πρόγραμμα:...

   v0.1:


 **************************************************************/



// Είσοδοι / Έξοδοι - Pins
const int redLedPin = 2;      // LED Έλλειψη νερού
const int greenLedPin = 3;    // LED Κανονική υγρασία για το φυτό
const int blueLedPin = 4;     // LED Πότισμα
const int pumpPin = 12;       // Αντλία ποτίσματος
const int waterLevelPin = A3; // Αισθητήρας στάθμης νερού
const int moistureSensorPin = 7; // Αισθητήρας υγρασίας χώματος

// Ρυθμίσεις
long checkInterval = 1800;    // Χρόνος μεταξύ μετρήσεων (ms)


/////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////

void setup() {
  SerialMon.begin(9600);
  delay(10);


}


void loop()
{

}


//--------------------------------------------------------------------------------------

/////////////////////////////////////////////////////////////////////////////////////////
///                      S E N S O R    F u n c t i o n s                             ///
/////////////////////////////////////////////////////////////////////////////////////////
